import '../models/current_user.dart';

abstract interface class INetworkFacade {
  // АВТРИЗАЦИЯ:
  // ---------------------------------------------------------------------------
  // ---------------------------------------------------------------------------
  // ---------------------------------------------------------------------------
  /// Проверка залогиненности пользователя
  CurrentUser? checkAuth();

  /// Логин пользователя
  Future<CurrentUser?> logIn({
    required String email,
    required String password,
  });

  /// Регистрация пользователя
  Future<CurrentUser?> registration({
    required String email,
    required String password,
  });

  /// Разлогин пользователя
  Future<void> logOut();

// ---------------------------------------------------------------------------
// ---------------------------------------------------------------------------
// ---------------------------------------------------------------------------
}
